Repository: ngonzanosaborperuano/comidaperuana
Catalog: lib/l10n/app_localizations_*.arb
Languages: es

# welcome
source: Welcome to peruvian food
es: Bienvenido a CocinandoIA

# descriptionWelcome
source: The best of Peruvian gastronomy.
es: Lo mejor de la gastronomia.

source: Get Started
es: Empezar

source: Login
es: Iniciar sesión

# descriptionLogin
source: Sign in to your account to see your favorite recipes.
es: Accede a tu cuenta para ver tus recetas favoritas.

source: Email
es: Correo

source: Password
es: Contraseña

# enterPassword
source: Enter a password
es: Ingrese una Contraseña

source: New User
es: Nuevo usuario

# titleAccessDenied
source: Access denied
es: Acceso denegado

# textAccessDenied
source: The data entered is incorrect or you do not have a registered user, please try again.
es: Los datos ingresados son incorrectos o no tiene un usuario registrado, vuelva a intentarlo.

# validateEmpty
source: This field is required.
es: Este campo es requerido.

# emptyPassword
source: The password cannot be empty.
es: La contraseña no puede estar vacía.

# minEightCharacters
source: * Must be at least 8 characters long.
es: * Debe tener al menos 8 caracteres.

# labelUpper
source: * Must contain at least one capital letter
es: * Debe contener al menos una letra mayúscula.

# labelLower
source: * Must contain at least one lowercase letter
es: * Debe contener al menos una letra minúscula

# anyNumber
source: * Must contain at least one number
es: * Debe contener al menos un número.

# specialCharacter
source: * Must contain at least one special character.
es: * Debe contener al menos un carácter especial.

# invalidPassword
source: The password is invalid
es: La contraseña es inválida

# validateList
source: This field is required.
es: Este campo es requerido.

# validateEmail
source: Enter a valid email address
es: Introduce un correo electrónico válido

source: Register Now
es: Registrar ahora

# enterEmail
source: Enter an email
es: Ingrese un correo

source: Repeat password
es: Repetir contraseña

source: Register
es: Registrarse

# validatePasswordText
source: The passwords do not match, please try again.
es: Las contraseñas no coinciden, vuelva a intentarlo.

source: Accept
es: Aceptar

source: Setting
es: Configuración

source: Log out
es: Cerrar sesión

source: First Name
es: Apellido Paterno

source: Last Name
es: Apellido Materno

# changeLanguage
source: Spanish
es: Español

source: Dark mode
es: Modo oscuro

source: Completed
es: Completado

source: Pending
es: Pendiente

source: Status
es: Estado

source: Title
es: Título

source: Search recipe
es: Buscar receta

# searchTitle
source: Search by title
es: Buscar por título

# insertTitle
source: Enter a title
es: Escriba un título

source: Body
es: Mensaje

# writeNote
source: Write a note
es: Escriba una nota

source: Add Note
es: Crea una nota

source: Save
es: Guardar

source: Back
es: Volver

# messageAddNote
source: A note was created successfully.
es: Se creó una nota exitosamente.

# messageDeleteNote
source: The note was deleted:
es: Se eliminó la nota:

source: Update task
es: Actualizar tarea

# messageUpdateNote
source: A note was updated successfully.
es: Se actualizó nota exitosamente.

# noNote
source: There is no note
es: No se encontraron notas.

source: List Pending
es: Lista de pendientes

# completeInformation
source: Please complete the details and create an account
es: Únete a CocinandoIA para descubrir recetas personalizadas, datos nutricionales.

source: User
es: Usuario

# or
source: Or continue with
es: O continúar con

# userPass
source: Username and password
es: Usuario y contraseña

source: Full Name
es: Nombre Completo

source: Enter full name
es: Ingrese nombre completo

# onboardingTitle1
source: Fresh and Delicious Meals
es: Comida fresca y deliciosa

# onboardingSubtitle1
source: Transform your daily cooking with personalized recipes, precise nutritional data, and the magic of Peruvian gastronomy. Every meal will be a unique experience!
es: Transforma tu cocina diaria con recetas personalizadas, datos nutricionales precisos y la magia de la gastronomía. ¡Cada comida será una experiencia única!

# onboardingTitle2
source: Cook at Home
es: Cocina en casa

# onboardingSubtitle2
source: Don't know what to cook today? Our AI suggests perfect dishes based on your ingredients, available time, and nutritional preferences. Cooking has never been easier!
es: ¿No sabes qué cocinar hoy? Nuestra IA te sugiere platos perfectos según tus ingredientes, tiempo disponible y preferencias nutricionales. ¡Cocinar nunca fue tan fácil!

# onboardingTitle3
source: Chef Recipes & Traditional Dishes
es: Recetas de chefs y platos típicos

# onboardingSubtitle3
source: Access exclusive recipes from professional chefs with detailed nutritional information, secret techniques, and authentic Peruvian flavors. Cook like an expert!
es: Accede a recetas exclusivas de chefs profesionales con información nutricional detallada, técnicas secretas y los auténticos sabores del Perú. ¡Cocina como un experto!

# onboardingTitle4
source: Welcome to Cocinando!
es: ¡Bienvenido a Cocinando!

# onboardingSubtitle4
source: Your intelligent culinary assistant that plans menus, calculates calories, optimizes nutrients, and inspires you daily. Discover the future of cooking!
es: Tu asistente culinario inteligente que planifica menús, calcula calorías, optimiza nutrientes y te inspira cada día. ¡Descubre el futuro de cocinar!

# unsupportedSignInMethod
source: Sign-in method not supported
es: Tipo de inicio de sesión no soportado

# signInError
source: Error during sign-in
es: Error al iniciar sesión

# googleSignInAborted
source: Google sign-in aborted by user
es: Inicio de sesión con Google cancelado por el usuario

# googleNoToken
source: Google sign-in failed: No access token or ID token received.
es: Fallo en el inicio de sesión con Google: No se recibió token de acceso ni token de ID.

# accountExistsWithDifferentCredential
source: The account already exists with a different credential.
es: La cuenta ya existe con una credencial diferente.

# invalidCredential
source: The credential received is invalid.
es: La credencial recibida no es válida.

# operationNotAllowed
source: Operation not allowed. Please enable Google sign-in in Firebase console.
es: Operación no permitida. Habilita el inicio de sesión con Google en la consola de Firebase.

# userDisabled
source: User disabled. Please contact support.
es: Usuario deshabilitado. Por favor, contacta con soporte.

# userNotFound
source: No user found for that email.
es: No se encontró un usuario con ese correo electrónico.

# wrongPassword
source: Wrong password provided for that user.
es: Contraseña incorrecta proporcionada para ese usuario.

# unknownGoogleSignInError
source: An unknown error occurred during Google sign-in
es: Ocurrió un error desconocido durante el inicio de sesión con Google

# googleSignInError
source: An error occurred during Google sign-in
es: Ocurrió un error durante el inicio de sesión con Google

# authSuccess
source: Login or registration successful
es: Inicio de sesión o registro exitoso

# authError
source: Error during login or registration
es: Error al iniciar sesión o registrar

# weakPassword
source: The password provided is too weak.
es: La contraseña proporcionada es demasiado débil.

# emailAlreadyInUse
source: The account already exists for that email.
es: La cuenta ya existe para ese correo electrónico.

# unknownEmailLoginError
source: An unknown error occurred during email/password login
es: Ocurrió un error desconocido durante el inicio de sesión con correo/contraseña

# emailLoginError
source: An error occurred during email/password login
es: Ocurrió un error durante el inicio de sesión con correo/contraseña

# recoverEmail
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# recoverAccountMessage
source: To recover your account, enter an email address and then accept. Check your email. If you don't see it, check your other emails or spam folders.
es: Para recuperar tu cuenta, ingresa una dirección de correo electrónico y luego enviar. Revisa tu correo. Si no lo ves, revisa otros correos o la carpeta de spam.

source: Recover password.
es: Recuperar contraseña

source: Send
es: Enviar

# errorUserNotFound
source: No user is registered with that email.
es: No hay ningún usuario registrado con ese correo.

# errorTooManyRequests
source: Too many requests. Please try again later.
es: Demasiadas solicitudes. Inténtalo más tarde.

# errorNetwork
source: Network error. Check your internet connection.
es: Error de red. Revisa tu conexión a internet.

# errorDefault
source: Invalid email format.
es: Formato del correo no válido.

# errorInvalidEmail
source: The email format is not valid.
es: El correo no tiene un formato válido.

# culinaryAssistant
source: Your intelligent culinary assistant
es: Tu asistente culinario inteligente

source: Welcome to CocinandoIA!
es: ¡Bienvenido a CocinandoIA!

# personalizeExperience
source: Let's personalize your experience to offer you the best recipes adapted to your needs.
es: Vamos a personalizar tu experiencia para ofrecerte las mejores recetas adaptadas a tus necesidades.

# continueButton
source: Continue
es: Continuar

# startCooking
source: Let's Start!
es: ¡Comenzar!

# followDietQuestion
source: Do you follow any specific diet?
es: ¿Sigues alguna dieta específica?

source: Select all that apply
es: Selecciona todas las que apliquen

# haveAllergiesQuestion
source: Do you have any allergies?
es: ¿Tienes alguna alergia?

# importantForSafety
source: This information is important for your safety
es: Esta información es importante para tu seguridad

# experienceLevelQuestion
source: What is your level of experience in the kitchen?
es: ¿Cuál es tu nivel de experiencia en la cocina?

source: Omnivore
es: Omnívoro

source: Vegetarian
es: Vegetariano

source: Vegan
es: Vegano

source: Pescatarian
es: Pescetariano

source: Gluten Free
es: Sin gluten

source: Lactose Free
es: Sin lactosa

source: Nuts
es: Frutos secos

source: Seafood
es: Mariscos

source: Eggs
es: Huevo

source: Dairy
es: Lácteos

source: Soy
es: Soya

source: Wheat
es: Trigo

source: Fish
es: Pescado

source: None
es: Ninguna

source: Beginner
es: Principiante

# beginnerDescription
source: I'm just learning the basics
es: Apenas estoy aprendiendo lo básico

source: Intermediate
es: Intermedio

# intermediateDescription
source: I can follow recipes without problems
es: Puedo seguir recetas sin problemas

source: Advanced
es: Avanzado

# advancedDescription
source: I like to experiment and create new dishes
es: Me gusta experimentar y crear nuevos platos

source: Professional Chef
es: Chef profesional

# professionalChefDescription
source: I have professional experience in cooking
es: Tengo experiencia profesional en cocina

source: Selection required
es: Selección requerida

# pleaseSelectAtLeastOne
source: Please select at least one option
es: Por favor selecciona al menos una opción

# setupDiet
source: Now let's set up your diet
es: Ahora configuremos tu dieta

source: Step 1 of 3
es: Paso 1 de 3

# allergyInfo
source: It's important to know your allergies for your safety
es: Es importante conocer tus alergias para tu seguridad

# allergyInfoTitle
source: Allergy information
es: Información sobre alergias

# finalStep
source: Finally, tell us your level of experience
es: Por último, cuéntanos tu nivel de experiencia

# finalStepTitle
source: Final step
es: Paso final

# setupCompleted
source: Setup completed successfully
es: Configuración completada exitosamente

# welcomeTitle
source: Welcome!
es: ¡Bienvenido!

# personalizedRecipes
source: Personalized culinary recipes
es: Recetas culinarias personalizadas

# discoverRecipes
source: Discover delicious recipes and culinary tips with Cocinando IA
es: Descubre deliciosas recetas y consejos culinarios con Cocinando IA

source: Cancel
es: Cancelar
